# Completions (fpath only, loaded before ez-compinit)
zsh-users/zsh-completions kind:fpath

# ez-compinit runs compinit at the right time (after fpath is set, before compdef calls)
mattmc3/ez-compinit

# OMZ lib must load before use-omz and OMZ plugins
ohmyzsh/ohmyzsh path:lib
getantidote/use-omz

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/rails
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/bundler

# Theme
romkatv/powerlevel10k

# These should be near the end — deferred for faster startup
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
